;<?php exit(); ?>

;
; Это персональный файл конфигурации local.php
; Здесь нужно переопределить настройки, которые необходимы
; для работы 
;
; Не коммитить в систему контроля версий!!!

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Эта директива указывает, что нужно расширить и переопределить
; настройки, указанные в файле "app/Config/common.php"
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

@extends = BASE_DIRECTORY "/config/common.php"


;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Настройки приложения
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[application]
debug = true

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;
; Настройки соединения 
; к базе данных MASTER 
; Запись в БД 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[master]
debug = true
user = "root"
password = "password"
host = "localhost"
database = "my_db_name"
