;<?php exit(); ?>

;
; Это персональный файл конфигурации local.php
; Здесь нужно переопределить настройки, которые необходимы
; для работы 
;
; Не коммитить в SVN!!!

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Эта директива указывает, что нужно расширить и переопределить
; настройки, указанные в файле "app/Config/common.php"
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

@extends = BASE_DIRECTORY "/config/common.php"


;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Настройки приложения
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[application]
url = "http://local-dance.ru"
debug = true


;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;
; Настройки соединения 
; к базе данных MASTER 
; Запись в БД 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[master]
debug = true
user = "root"
password = "password"
host = "localhost"
database = "classnet"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Используется репликация
;
; Настройки соединения 
; к базе данных SLAVE 
; Чтени из БД
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[slave]
debug = true
user = "root"
password = "password"
host = "localhost"
database = "classnet"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Logger options
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[logger]
logger.dir = BASE_DIRECTORY "/var/logs/"